// فراخوانی کتابخانه ی اسکنر برای دریافت ورودی
import java.util.Scanner;

// ساخت کلاس اصلی جاوا همنام با فایل جاوا برای پیاده سازی
public class area{

// ساخت تابع اصلی اجرایی در جاوا  با نوع داده ی خروجی نامشخص و پویا 
public static void main( String[]  args ){
    //حلقه ی بینهایت برای تکرار دریافت شعاع در صورت اشتباه ورودی 
    while(true){
    //کنترل کردن ارور احتمالی در برنامه با این دستور
    try{
    // نمایش پیام مناسب برای دریافت ورودی از کاربر.
    System.out.print("Radius = ");
    // ساخت یک متغیر با نوع دابل به دلیل طولانی تر بودن عدد پی از حافظه ی اعشار یا فلوت. برای ثبت عدد ورودی کاربر
    // دریافت عدد از کاربر با تابع ساخته شده در  همین کلاس
    double rad = return_float_inputted();
    // محاسبه ی مساحت دایره به همراه خواندن عدد پی از توابع درونی جاوا که نوع دابل است.
    double area = rad*rad*Math.PI ;
    // نمایش مساحت با پیام مناسب
    System.out.print("\nArea = "+area + "\n");
    
    }catch( Exception e ){     // کنترل ارور های احتمالی با پیام مناسب.
        System.out.println("<<< wrong input amount. try again. >>>");
}
}
}
// ساخت تابع دیگر درون این کلاس با نوع خروجی اعشار یا فلوت و دسترسی پویا تا نیاز به ساخت شی برای استفاده در این کلاس نباشد.
public static float return_float_inputted(){
    //ساخت یک شی از کلاس اسکنر برای دریافت ورودی
    Scanner scan_class = new Scanner(System.in) ;
    //دریافت ورودی از کاربر با نوع اعشار
    float amount = scan_class.nextFloat();
    //ارسال مقدار دریافت شده در خروجی 
    return amount;
}

}








